$ git fetch [им€ удал. сервера]
ƒанна€ команда св€зываетс€ с указанным удалЄнным проектом и забирает все те данные проекта, которых у вас ещЄ нет. ѕосле того как вы выполнили команду, у вас должны по€витьс€ ссылки на все ветки из этого удалЄнного проекта. “еперь эти ветки в любой момент могут быть просмотрены или слиты. (¬ главе 3 мы перейдЄм к более детальному рассмотрению, что такое ветки и как их использовать.)


“аким образом, git fetch origin извлекает все наработки, отправленные (push) на этот сервер после того, как вы склонировали его (или получили изменени€ с помощью fetch). 

$ git fetch origin